# Truss Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss Class
Members See Also
---
Represents all kinds of Trusses.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Truss : Element
```

Visual Basic
---
```text
Public Class Truss _
	Inherits Element
```

Visual C++
---
```text
public ref class Truss : public Element
```

# Remarks
The Truss object represents all the kinds of Trusses in Revit. The TrussType property is used to distinguish the type of the Truss.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..Truss
# See Also
Truss Members
Autodesk.Revit.DB.Structure Namespace